---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsMultiPlaneError
source: html/0d7d5708-4e83-4961-a7f3-bd1899072453.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsMultiPlaneError Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinElementsMultiPlaneError { get; }
```